<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Comment</key>
	<string>Created with Recipe Robot v1.1.2 (https://github.com/homebysix/recipe-robot)</string>
	<key>Description</key>
	<string>Downloads the latest version of Cisco Umbrella Roaming Client.</string>
	<key>Identifier</key>
	<string>com.github.dwenger.download.CiscoUmbrellaRoamingClient</string>
	<key>Input</key>
	<dict>
		<key>APP_FILENAME</key>
		<string>Cisco Umbrella Roaming Client</string>
		<key>SEARCH_URL</key>
		<string>https://disthost.umbrella.com/roaming/upgrade/mac/stage/manifest.json</string>
		<key>SEARCH_PATTERN</key>
		<string>RoamingClient_MAC_(?P&lt;version&gt;.*?).pkg.zip</string>
		<key>NAME</key>
		<string>Cisco Umbrella Roaming Client</string>
		<key>DOWNLOAD_URL</key>
		<string>https://disthost.umbrella.com/roaming/upgrade/mac/stage</string>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.0</string>
	<key>Process</key>
	<array>
		<dict>
		    <key>Processor</key>
		    <string>URLTextSearcher</string>
		    <key>Arguments</key>
		    <dict>
			<key>url</key>
			<string>%SEARCH_URL%</string>
			<key>re_pattern</key>
			<string>%SEARCH_PATTERN%</string>
		    </dict>
		</dict>
		<dict>
		    <key>Processor</key>
		    <string>URLDownloader</string>
		    <key>Arguments</key>
		    <dict>
			<key>url</key>
			<string>%DOWNLOAD_URL%/RoamingClient_MAC_%version%.pkg.zip</string>
		    </dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>archive_path</key>
				<string>%pathname%</string>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%</string>
				<key>purge_destination</key>
				<true/>
			</dict>
			<key>Processor</key>
			<string>Unarchiver</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pattern</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%/RoamingClient_MAC_*.pkg</string>
			</dict>
			<key>Processor</key>
			<string>FileFinder</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>expected_authority_names</key>
				<array>
					<string>Developer ID Installer: OpenDNS (7P7HQ8H646)</string>
					<string>Developer ID Certification Authority</string>
					<string>Apple Root CA</string>
				</array>
				<key>input_path</key>
				<string>%found_filename%</string>
			</dict>
			<key>Processor</key>
			<string>CodeSignatureVerifier</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/unpack</string>
				<key>flat_pkg_path</key>
				<string>%found_filename%</string>
				<key>purge_destination</key>
				<true/>
			</dict>
			<key>Processor</key>
			<string>FlatPkgUnpacker</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/payload</string>
				<key>pkg_payload_path</key>
				<string>%RECIPE_CACHE_DIR%/unpack/Roaming_Client.pkg/Payload</string>
				<key>purge_destination</key>
				<true/>
			</dict>
			<key>Processor</key>
			<string>PkgPayloadUnpacker</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>input_plist_path</key>
				<string>%RECIPE_CACHE_DIR%/payload/Applications/OpenDNS Roaming Client/Umbrella Diagnostic.app/Contents/Info.plist</string>
				<key>plist_version_key</key>
				<string>CFBundleVersion</string>
			</dict>
			<key>Processor</key>
			<string>Versioner</string>
		</dict>
	</array>
</dict>
</plist>
