<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Creates a pkg from the MOZA Assistant app.</string>
	<key>Identifier</key>
	<string>edu.cvtc.autopkg.munki.MOZAAssistant</string>
	<key>ParentRecipe</key>
	<string>edu.cvtc.autopkg.pkg.MOZAAssistant</string>
	<key>Input</key>
	<dict>
		<key>BUNDLE_ID</key>
		<string>com.gudsen.MOZA-Assistant</string>
		<key>NAME</key>
		<string>MOZA Assistant</string>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>apps/%NAME%</string>
		<key>pkginfo</key>
		<dict>
			<key>catalogs</key>
			<array>
				<string>testing</string>
				<string>production</string>
			</array>
			<key>description</key>
			<string>App to control the MOZA Air family of camera gimbals.</string>
			<key>developer</key>
			<string>Gudsen Technology</string>
			<key>display_name</key>
			<string>MOZA Assistant</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>unattended_install</key>
			<true/>
		</dict>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.0</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%RECIPE_CACHE_DIR%/MOZA_Assistant-%version%.pkg</string>
				<key>repo_subdirectory</key>
				<string>%MUNKI_REPO_SUBDIR%</string>
			</dict>
			<key>Processor</key>
			<string>MunkiImporter</string>
		</dict>
	</array>
</dict>
</plist>
