<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of Cambrionix Connect.</string>
	<key>Identifier</key>
	<string>com.github.dwenger.download.CambrionixConnect</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Cambrionix Connect</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.1.0</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
                <key>url</key>
                <string>https://www.cambrionix.com/products/cambrionix-connect/</string>
				<key>re_pattern</key>
				<string>https:\/\/downloads.cambrionix.com\/connect\/.*\/Connect-.*-mac-universal.dmg</string>
			</dict>
			<key>Processor</key>
			<string>URLTextSearcher</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
                <key>url</key>
                <string>%match%</string>
				<key>filename</key>
				<string>%NAME%.dmg</string>
			</dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>input_path</key>
				<string>%pathname%/Cambrionix\ Connect.app</string>
				<key>requirement</key>
				<string>identifier "com.cambrionix.connect" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = "55C2J663BC"</string>
			</dict>
			<key>Processor</key>
			<string>CodeSignatureVerifier</string>
		</dict>
	</array>
</dict>
</plist>