<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of LiveViewer.</string>
	<key>Identifier</key>
	<string>com.github.dwenger.download.LiveViewer</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>LiveViewer</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.1.0</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
                <key>url</key>
                <string>https://cambrionixtest.wpengine.com/products/liveviewer#downloadLV2</string>
				<key>re_pattern</key>
				<string>https:\/\/cambrionixtest\.wpengine\.com\/Downloads\/LiveViewer\/LiveViewer-.*-universal.dmg</string>
			</dict>
			<key>Processor</key>
			<string>URLTextSearcher</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
                <key>url</key>
                <string>%match%</string>
				<key>filename</key>
				<string>%NAME%.dmg</string>
			</dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>input_path</key>
				<string>%pathname%/LiveViewer.app</string>
				<key>requirement</key>
				<string>identifier "com.cambrionix.liveviewer" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = "55C2J663BC"</string>
			</dict>
			<key>Processor</key>
			<string>CodeSignatureVerifier</string>
		</dict>
	</array>
</dict>
</plist>