<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Identifier</key>
	<string>edu.cvtc.autopkg.munki.Python3</string>
	<key>Input</key>
	<dict>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>apps/%NAME%</string>
		<key>NAME</key>
		<string>Python3</string>
		<key>pkginfo</key>
		<dict>
			<key>catalogs</key>
			<array>
				<string>testing,production</string>
			</array>
			<key>description</key>
			<string>Python is a programming language that lets you work quickly and integrate systems more effectively.</string>
			<key>display_name</key>
			<string>Python 3</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>unattended_install</key>
			<true/>
			<key>installer_choices_xml</key>
			<array>
				<dict>
					<key>attributeSetting</key>
					<integer>1</integer>
					<key>choiceAttribute</key>
					<string>selected</string>
					<key>choiceIdentifier</key>
					<string>org.python.Python.PythonFramework-3.8</string>
				</dict>
				<dict>
					<key>attributeSetting</key>
					<integer>1</integer>
					<key>choiceAttribute</key>
					<string>selected</string>
					<key>choiceIdentifier</key>
					<string>org.python.Python.PythonApplications-3.8</string>
				</dict>
				<dict>
					<key>attributeSetting</key>
					<integer>1</integer>
					<key>choiceAttribute</key>
					<string>selected</string>
					<key>choiceIdentifier</key>
					<string>org.python.Python.PythonUnixTools-3.8</string>
				</dict>
				<dict>
					<key>attributeSetting</key>
					<integer>0</integer>
					<key>choiceAttribute</key>
					<string>selected</string>
					<key>choiceIdentifier</key>
					<string>org.python.Python.PythonDocumentation-3.8</string>
				</dict>
				<dict>
					<key>attributeSetting</key>
					<integer>1</integer>
					<key>choiceAttribute</key>
					<string>selected</string>
					<key>choiceIdentifier</key>
					<string>org.python.Python.PythonProfileChanges-3.8</string>
				</dict>
				<dict>
					<key>attributeSetting</key>
					<integer>1</integer>
					<key>choiceAttribute</key>
					<string>selected</string>
					<key>choiceIdentifier</key>
					<string>org.python.Python.PythonInstallPip-3.8</string>
				</dict>
			</array>
		</dict>
	</dict>
	<key>ParentRecipe</key>
	<string>com.github.scriptingosx.munki.Python3</string>
	<key>ParentRecipeTrustInfo</key>
	<dict>
		<key>non_core_processors</key>
		<dict/>
		<key>parent_recipes</key>
		<dict>
			<key>com.github.scriptingosx.download.Python3</key>
			<dict>
				<key>git_hash</key>
				<string>57b9a80e3f9b5dda528776e8063d12b5a8cdc107</string>
				<key>path</key>
				<string>~/Library/AutoPkg/RecipeRepos/com.github.autopkg.scriptingosx-recipes/Python3/Python3.download.recipe</string>
				<key>sha256_hash</key>
				<string>c457019eccfaef2c2fa573fbad0f1376860aefc720fe93fd8a0724429a13c32c</string>
			</dict>
			<key>com.github.scriptingosx.munki.Python3</key>
			<dict>
				<key>git_hash</key>
				<string>44a27830326e00d47dc6b8c3412a1bc207fd5e90</string>
				<key>path</key>
				<string>~/Library/AutoPkg/RecipeRepos/com.github.autopkg.scriptingosx-recipes/Python3/Python3.munki.recipe</string>
				<key>sha256_hash</key>
				<string>e09ac26591ebdba2cb8daed8dcad785d5cae9c0cdb3637fc9fe093fe740caafe</string>
			</dict>
			<key>com.github.scriptingosx.pkg.Python3</key>
			<dict>
				<key>git_hash</key>
				<string>344bd33c9077f39226ffb58894476747ccda0749</string>
				<key>path</key>
				<string>~/Library/AutoPkg/RecipeRepos/com.github.autopkg.scriptingosx-recipes/Python3/Python3.pkg.recipe</string>
				<key>sha256_hash</key>
				<string>33eadf05857d9381670f96b5f53f466fe902961298196e986f46f6167f2e2436</string>
			</dict>
		</dict>
	</dict>
</dict>
</plist>
