<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads Aftermath and imports into Munki.</string>
	<key>Identifier</key>
	<string>com.github.dwenger.munki.Aftermath</string>
	<key>Input</key>
	<dict>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>apps</string>
		<key>NAME</key>
		<string>Aftermath</string>
		<key>APP_DESTINATION</key>
		<string>/Applications</string>
	</dict>
    <key>ParentRecipe</key>
    <string>com.github.dwenger.download.Aftermath</string>
	<key>Process</key>
	<array>
		<dict>
            <key>Processor</key>
			<string>GitHubReleasesInfoProvider</string>
			<key>Arguments</key>
			<dict>
				<key>asset_regex</key>
				<string>Aftermath.pkg</string>
				<key>github_repo</key>
				<string>jamf/aftermath</string>
			</dict>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%pathname%</string>
				<key>repo_subdirectory</key>
				<string>%MUNKI_REPO_SUBDIR%</string>
				<key>pkginfo</key>
				<dict>
					<key>catalogs</key>
					<array>
						<string>testing</string>
					</array>
					<key>description</key>
					<string>Aftermath is a Swift-based, open-source incident response framework.</string>
					<key>display_name</key>
					<string>Aftermath</string>
					<key>name</key>
					<string>%NAME%</string>
					<key>unattended_install</key>
					<true/>
					<key>version</key>
					<string>%version%</string>
					<key>category</key>
					<string>Utilities</string>
					<key>developer</key>
					<string>Jamf</string>
				</dict>
			</dict>
			<key>Processor</key>
			<string>MunkiImporter</string>
		</dict>
	</array>
</dict>
</plist>