<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Download recipe for Aftermath.</string>
    <key>Identifier</key>
    <string>com.github.dwenger.download.Aftermath</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>Aftermath</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.1.0</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
			<string>GitHubReleasesInfoProvider</string>
			<key>Arguments</key>
			<dict>
				<key>asset_regex</key>
				<string>Aftermath.pkg</string>
				<key>github_repo</key>
				<string>jamf/aftermath</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>URLDownloader</string>
			<key>Arguments</key>
			<dict>
				<key>url</key>
                <string>%url%</string>
				<key>filename</key>
				<string>%NAME%.pkg</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
		<dict>   
            <key>Processor</key>   
            <string>CodeSignatureVerifier</string>   
            <key>Arguments</key>   
            <dict>   
                <key>input_path</key>   
                <string>%pathname%</string>
                <key>expected_authority_names</key>
                <array>
                    <string>Developer ID Installer: Stuart Ashenbrenner (6PV5YF2UES)</string>
                    <string>Developer ID Certification Authority</string>
                    <string>Apple Root CA</string>
                </array>
            </dict>
        </dict>
    </array>
</dict>
</plist>