
<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Uploads Smart Label Creator pkg to Munki.</string>
	<key>Identifier</key>
	<string>edu.cvtc.autopkg.pkg.SIISmartLabelCreator</string>
	<key>ParentRecipe</key>
	<string>edu.cvtc.autopkg.download.SIISmartLabelCreator</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Smart Label Creator</string>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.0</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>archive_path</key>
				<string>%pathname%</string>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%/</string>
				<key>purge_destination</key>
				<true/>
			</dict>
			<key>Processor</key>
			<string>Unarchiver</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%.pkg</string>
				<key>source_path</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%/SLP_MacAPP_EN/SII Smart Label Printer.pkg</string>
			</dict>
			<key>Processor</key>
			<string>Copier</string>
		</dict>
	</array>
</dict>
</plist>
