<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Uploads Smart Label Creator pkg to Munki.</string>
	<key>Identifier</key>
	<string>edu.cvtc.autopkg.munki.SIISmartLabelCreator</string>
	<key>ParentRecipe</key>
	<string>edu.cvtc.autopkg.pkg.SIISmartLabelCreator</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Smart Label Creator</string>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>apps/%NAME%</string>
		<key>pkginfo</key>
		<dict>
			<key>catalogs</key>
			<array>
				<string>testing</string>
				<string>production</string>
			</array>
			<key>description</key>
			<string>Create labels and control your Seiko Instruments Smart Label Printer.</string>
			<key>developer</key>
			<string>Seiko Instruments USA Inc.</string>
			<key>display_name</key>
			<string>Smart Label Creator</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>unattended_install</key>
			<true/>
		</dict>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.0</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%.pkg</string>
				<key>repo_subdirectory</key>
				<string>%MUNKI_REPO_SUBDIR%</string>
			</dict>
			<key>Processor</key>
			<string>MunkiImporter</string>
		</dict>
	</array>
</dict>
</plist>
