<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
	<dict>
		<key>Description</key>
		<string>Downloads the latest version of Splashtop Business Access.</string>
		<key>Identifier</key>
		<string>com.github.dwenger.download.SplashtopBusinessAccess</string>
		<key>Input</key>
		<dict>
			<key>NAME</key>
			<string>SplashtopBusinessAccess</string>
			<key>SCRAPE_URL</key>
			<string>https://www.splashtop.com/wp-content/themes/responsive/downloadx.php?product=stb&amp;platform=mac-client&amp;r=</string>
			<key>REG_EX</key>
			<string>Splash.*\.dmg</string>
		</dict>
		<key>MinimumVersion</key>
		<string>1.0</string>
		<key>Process</key>
		<array>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>url</key>
					<string>%SCRAPE_URL%</string>
					<key>result_output_var_name</key>
					<string>URL</string>
					<key>re_pattern</key>
					<string>%REG_EX%</string>
                    <key>request_headers</key>
                    <dict>
                        <key>user-agent</key>
                        <string>Mozilla/5.0 (Macintosh; Intel Mac OS X 10_10; rv:33.0) Gecko/20100101 Firefox/33.0</string>
                    </dict>
				</dict>
				<key>Processor</key>
				<string>URLTextSearcher</string>
			</dict>
			<dict>
				<key>Arguments</key>
				<dict>
                    <key>url</key>
				    <string>https://download.splashtop.com/macclient/STB/%URL%</string>
					<key>filename</key>
					<string>%NAME%.dmg</string>
				</dict>
				<key>Processor</key>
				<string>URLDownloader</string>
			</dict>
			<dict>
				<key>Processor</key>
				<string>EndOfCheckPhase</string>
			</dict>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>input_path</key>
					<string>%pathname%/Splashtop Business.pkg</string>
					<key>expected_authority_names</key>
					<array>
						<string>Developer ID Installer: Splashtop Inc. (CPQQ3AW49Y)</string>
						<string>Developer ID Certification Authority</string>
						<string>Apple Root CA</string>
					</array>
				</dict>
				<key>Processor</key>
				<string>CodeSignatureVerifier</string>
			</dict>
		</array>
	</dict>
</plist>
