<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
	<dict>
		<key>Description</key>
		<string>Downloads the latest version of Splashtop Business Access.</string>
		<key>Identifier</key>
		<string>com.github.dwenger.download.SplashtopBusinessAccess</string>
		<key>Input</key>
		<dict>
			<key>NAME</key>
			<string>SplashtopBusinessAccess</string>
			<key>URL</key>
			<string>https://my.splashtop.com/src/mac</string>
		</dict>
		<key>MinimumVersion</key>
		<string>1.0</string>
		<key>Process</key>
		<array>
			<dict>
				<key>Arguments</key>
				<dict>
                    <key>url</key>
				    <string>%URL%</string>
					<key>filename</key>
					<string>%NAME%.dmg</string>
				</dict>
				<key>Processor</key>
				<string>URLDownloader</string>
			</dict>
			<dict>
				<key>Processor</key>
				<string>EndOfCheckPhase</string>
			</dict>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>input_path</key>
					<string>%pathname%/Splashtop Business.pkg</string>
					<key>expected_authority_names</key>
					<array>
						<string>Developer ID Installer: Splashtop Inc. (CPQQ3AW49Y)</string>
						<string>Developer ID Certification Authority</string>
						<string>Apple Root CA</string>
					</array>
				</dict>
				<key>Processor</key>
				<string>CodeSignatureVerifier</string>
			</dict>
		</array>
	</dict>
</plist>
