<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the current release of Dockutil from Github. Forked from jessepeterson-recipes.</string>
    <key>Identifier</key>
    <string>com.github.dwenger.download.dockutil</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>dockutil</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.0</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>GitHubReleasesInfoProvider</string>
            <key>Arguments</key>
            <dict>
                <key>github_repo</key>
                <string>kcrawford/dockutil</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>filename</key>
                <string>%NAME%.pkg</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
        <dict>
        <key>Arguments</key>
        <dict>
            <key>input_path</key>
            <string>%pathname%</string>
            <key>expected_authority_names</key>
            <array>
                <string>Developer ID Installer: Kyle Crawford (Z5J8CJBUWC)</string>
                <string>Developer ID Certification Authority</string>
                <string>Apple Root CA</string>
            </array>
        </dict>
        <key>Processor</key>
        <string>CodeSignatureVerifier</string>
        </dict>
    </array>
</dict>
</plist>